app/controllers/tech_reports_controller.rb

  def index
    @tech_reports = TechReport.all
---
SELECT * FROM "tech_reports"

  def show
    @tech_report = TechReport.find(params[:id])
---
SELECT * FROM "tech_reports" WHERE ("tech_reports"."id" = 1)

  def create
    @tech_report = TechReport.new(params[:tech_report])
    @tech_report.tech_report = params[:file]
    @tech_report.save!
---
INSERT INTO "tech_reports" ("tr", "title", "abstract", "authors", "date", "created_at", "updated_at") VALUES(954, 'This is a Tech Report', 'Abstract:

  def destroy
    @tech_report = TechReport.find(params[:id])
    @tech_report.destroy
---
SELECT * FROM "tech_reports" WHERE ("tech_reports"."id" = 1)
DELETE FROM "tech_reports" WHERE "id" = 1